## Plans :heavy_multiplication_x:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/87d7d9f6-0f51-4e7a-9ae0-73b75ee4f0fe).


Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>

<details>
  <summary><h3>Pre Hooks</h3></summary>

**Step**: run
**Success**: :thumbsup:
**Command**: `/github/workspace/scripts/install_pkgs.sh`
```
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100  9.8M  100  9.8M    0     0  81.8M      0 --:--:-- --:--:-- --:--:-- 81.8M
Get:1 http://deb.debian.org/debian bullseye InRelease [116 kB]
Get:2 http://deb.debian.org/debian bullseye-updates InRelease [44.1 kB]
Get:3 http://security.debian.org/debian-security bullseye-security InRelease [27.2 kB]
Get:4 http://deb.debian.org/debian bullseye/main amd64 Packages [8066 kB]
Get:5 http://deb.debian.org/debian bullseye-updates/main amd64 Packages [18.8 kB]
Get:6 http://security.debian.org/debian-security bullseye-security/main amd64 Packages [321 kB]
Fetched 8593 kB in 1s (8264 kB/s)
Reading package lists...
Reading package lists...
Building dependency tree...
Reading state information...
jq is already the newest version (1.6-2.1).
The following additional packages will be installed:
  libpng16-16 libqrencode4 libxmuu1 qrencode tree xauth xclip
Suggested packages:
  python libxml-simple-perl ruby
The following NEW packages will be installed:
  libpng16-16 libqrencode4 libxmuu1 pass qrencode tree xauth xclip
0 upgraded, 8 newly installed, 0 to remove and 37 not upgraded.
Need to get 554 kB of archives.
After this operation, 1107 kB of additional disk space will be used.
Get:1 http://deb.debian.org/debian bullseye/main amd64 libpng16-16 amd64 1.6.37-3 [294 kB]
Get:2 http://deb.debian.org/debian bullseye/main amd64 libqrencode4 amd64 4.1.1-1 [40.4 kB]
Get:3 http://deb.debian.org/debian bullseye/main amd64 libxmuu1 amd64 2:1.1.2-2+b3 [23.9 kB]
Get:4 http://deb.debian.org/debian bullseye/main amd64 tree amd64 1.8.0-1+b1 [49.6 kB]
Get:5 http://deb.debian.org/debian bullseye/main amd64 pass all 1.7.3-2 [39.2 kB]
Get:6 http://deb.debian.org/debian bullseye/main amd64 qrencode amd64 4.1.1-1 [42.6 kB]
Get:7 http://deb.debian.org/debian bullseye/main amd64 xauth amd64 1:1.1-1 [40.5 kB]
Get:8 http://deb.debian.org/debian bullseye/main amd64 xclip amd64 0.13-2 [23.3 kB]
debconf: unable to initialize frontend: Dialog
debconf: (TERM is not set, so the dialog frontend is not usable.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin: 
Fetched 554 kB in 0s (11.1 MB/s)
Selecting previously unselected package libpng16-16:amd64.
(Reading database ... (Reading database ... 5%(Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%(Reading database ... 80%(Reading database ... 85%(Reading database ... 90%(Reading database ... 95%(Reading database ... 100%(Reading database ... 14110 files and directories currently installed.)
Preparing to unpack .../0-libpng16-16_1.6.37-3_amd64.deb ...
Unpacking libpng16-16:amd64 (1.6.37-3) ...
Selecting previously unselected package libqrencode4:amd64.
Preparing to unpack .../1-libqrencode4_4.1.1-1_amd64.deb ...
Unpacking libqrencode4:amd64 (4.1.1-1) ...
Selecting previously unselected package libxmuu1:amd64.
Preparing to unpack .../2-libxmuu1_2%3a1.1.2-2+b3_amd64.deb ...
Unpacking libxmuu1:amd64 (2:1.1.2-2+b3) ...
Selecting previously unselected package tree.
Preparing to unpack .../3-tree_1.8.0-1+b1_amd64.deb ...
Unpacking tree (1.8.0-1+b1) ...
Selecting previously unselected package pass.
Preparing to unpack .../4-pass_1.7.3-2_all.deb ...
Unpacking pass (1.7.3-2) ...
Selecting previously unselected package qrencode.
Preparing to unpack .../5-qrencode_4.1.1-1_amd64.deb ...
Unpacking qrencode (4.1.1-1) ...
Selecting previously unselected package xauth.
Preparing to unpack .../6-xauth_1%3a1.1-1_amd64.deb ...
Unpacking xauth (1:1.1-1) ...
Selecting previously unselected package xclip.
Preparing to unpack .../7-xclip_0.13-2_amd64.deb ...
Unpacking xclip (0.13-2) ...
Setting up libqrencode4:amd64 (4.1.1-1) ...
Setting up libpng16-16:amd64 (1.6.37-3) ...
Setting up tree (1.8.0-1+b1) ...
Setting up xclip (0.13-2) ...
Setting up pass (1.7.3-2) ...
Setting up libxmuu1:amd64 (2:1.1.2-2+b3) ...
Setting up qrencode (4.1.1-1) ...
Setting up xauth (1:1.1-1) ...
Processing triggers for libc-bin (2.31-13+deb11u3) ...

```
**Step**: run
**Success**: :thumbsup:
**Command**: `/github/workspace/scripts/setup_akash.sh`
```
akash-network/provider info checking GitHub for latest tag
akash-network/provider info found version: 0.6.4 for v0.6.4/linux/amd64
Archive:  provider-services_0.6.4_linux_amd64.zip
  inflating: provider-services       
akash-network/provider info installed ./bin/provider-services
gpg-connect-agent: no running gpg-agent - starting '/usr/bin/gpg-agent'
gpg-connect-agent: waiting for the agent to come up ... (5s)
gpg-connect-agent: connection to agent established
OK
gpg: checking the trustdb
gpg: marginals needed: 3  completes needed: 1  trust model: pgp
gpg: depth: 0  valid:   1  signed:   0  trust: 0-, 0q, 0n, 0m, 0f, 1u
gpg: inserting ownertrust of 6
mkdir: created directory '/github/home/.password-store/'
Password store initialized for 5D42E301B7AB8EC0
{"name":"akash_deploy","type":"local","address":"***","pubkey":"{\"@type\":\"/cosmos.crypto.secp256k1.PubKey\",\"key\":\"AtBpJ4V70IFCUCzdCSPZTpXKYf23bA12H6RqMtVf7AJj\"}"}
✓ Container environment setup complete
ALLOWED PROVIDERS 

```
**Step**: env
**Success**: :thumbsup:
**Command**: `/github/workspace/scripts/setup_akash_rpc.sh`
```
https://akash-rpc.polkachu.com:443

```
**Step**: env
**Success**: :thumbsup:
**Command**: `/github/workspace/scripts/akash_providers.sh`
```
["akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"]

```
</details>

<details>
  <summary><h3>Post Hooks</h3></summary>

</details>


## Dir: layers/services | :heavy_multiplication_x:
**Dir**: layers/services
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:
```

```
**Step**: env
**Success**: :thumbsup:
**Command**: `bash -c set -e
set -u
source "$@" > /tmp/tmpp1so2_ok 2>&1
env -0 bash /github/workspace/scripts/s3_backend.sh`
```

```
**Step**: init
**Success**: :thumbsup:
**Command**: `tofu init -backend-config=backend.hcl -migrate-state`
```
Resolved version from TOFUENV_TOFU_DEFAULT_VERSION : 1.8.4
Installing OpenTofu 1.8.4
Fetching release information from https://api.github.com/repos/opentofu/opentofu/releases/tags/v1.8.4
Downloading https://github.com/opentofu/opentofu/releases/download/v1.8.4/tofu_1.8.4_linux_amd64.zip
Downloading https://github.com/opentofu/opentofu/releases/download/v1.8.4/tofu_1.8.4_SHA256SUMS
Downloading https://github.com/opentofu/opentofu/releases/download/v1.8.4/tofu_1.8.4_SHA256SUMS.sig
Downloading https://github.com/opentofu/opentofu/releases/download/v1.8.4/tofu_1.8.4_SHA256SUMS.pem
cosign executable not found, fallback to pgp check
Downloading https://github.com/opentofu/opentofu/releases/download/v1.8.4/tofu_1.8.4_SHA256SUMS.gpgsig
Downloading https://get.opentofu.org/opentofu.asc
Installation of OpenTofu 1.8.4 successful

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/LumeWeb/terraform-modules.git?ref=develop for mysql_cluster...
- mysql_cluster in .terraform/modules/mysql_cluster/modules/db/mysql-cluster
- mysql_cluster.master in .terraform/modules/mysql_cluster/modules/db/mysql
- mysql_cluster.master.mysql_deployment in .terraform/modules/mysql_cluster/modules/compute/akash
- mysql_cluster.slaves in .terraform/modules/mysql_cluster/modules/db/mysql
- mysql_cluster.slaves.mysql_deployment in .terraform/modules/mysql_cluster/modules/compute/akash
Downloading git::https://github.com/LumeWeb/terraform-modules.git?ref=develop for proxysql...
- proxysql in .terraform/modules/proxysql/modules/db/proxysql
- proxysql.proxysql_deployment in .terraform/modules/proxysql/modules/compute/akash
Downloading git::https://github.com/LumeWeb/terraform-modules.git?ref=develop for renterd_cluster...
- renterd_cluster in .terraform/modules/renterd_cluster/modules/compute/renterd-cluster
- renterd_cluster.renterd_autopilot in .terraform/modules/renterd_cluster/modules/compute/renterd
- renterd_cluster.renterd_autopilot.renterd_deployment in .terraform/modules/renterd_cluster/modules/compute/akash
- renterd_cluster.renterd_bus in .terraform/modules/renterd_cluster/modules/compute/renterd
- renterd_cluster.renterd_bus.renterd_deployment in .terraform/modules/renterd_cluster/modules/compute/akash
- renterd_cluster.renterd_workers in .terraform/modules/renterd_cluster/modules/compute/renterd
- renterd_cluster.renterd_workers.renterd_deployment in .terraform/modules/renterd_cluster/modules/compute/akash

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to OpenTofu
- Finding cloudflare/cloudflare versions matching "5.0.0-alpha1"...
- Finding registry.terraform.io/lumeweb/akash versions matching "0.1.1"...
- Finding latest version of hashicorp/null...
- Installing cloudflare/cloudflare v5.0.0-alpha1...
- Installed cloudflare/cloudflare v5.0.0-alpha1 (signed, key ID C76001609EE3B136)
- Installing registry.terraform.io/lumeweb/akash v0.1.1...
- Installed registry.terraform.io/lumeweb/akash v0.1.1 (signed, key ID 3092C291174CD877)
- Installing hashicorp/null v3.2.3...
- Installed hashicorp/null v3.2.3 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.

OpenTofu has been successfully initialized!

```
**Step**: plan
**Success**: :heavy_multiplication_x:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpb1a_zj3r/plan`
```
data.terraform_remote_state.remote_states: Reading...
data.terraform_remote_state.remote_states: Read complete after 0s

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # module.proxysql.module.proxysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql_cluster.module.master.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql_cluster.module.slaves["0"].module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mysql_cluster = {
      + info     = {
          + environment = "dev"
          + name        = "mysql"
          + size        = 2
        }
      + master   = {
          + endpoint = (known after apply)
          + host     = (known after apply)
          + port     = (known after apply)
        }
      + replicas = {
          + "0" = {
              + endpoint = (known after apply)
              + host     = (known after apply)
              + port     = (known after apply)
            }
        }
    }
  + proxysql      = {
      + admin_port = 6032
      + endpoint   = (known after apply)
      + state      = (known after apply)
    }
╷
│ Warning: Check block assertion failed
│ 
│   on .terraform/modules/renterd_cluster/modules/compute/renterd/validations.tf line 13, in check "database_configuration":
│   13:     condition = (!var.cluster && var.mode == "solo" && var.database != null) || (var.cluster && var.mode == "bus" && var.database != null) || (var.mode != "bus" && var.mode != "solo")
│     ├────────────────
│     │ var.cluster is true
│     │ var.database is null
│     │ var.mode is "bus"
│ 
│ Database configuration is required for bus mode (in cluster) and solo mode
│ (non-cluster)
╵
╷
│ Error: Attempt to get attribute from null value
│ 
│   on .terraform/modules/renterd_cluster/modules/compute/renterd/locals.tf line 94, in locals:
│   94:     RENTERD_DB_URI          = var.database.uri
│     ├────────────────
│     │ var.database is null
│ 
│ This value is null, so it does not have any attributes.
╵
╷
│ Error: Attempt to get attribute from null value
│ 
│   on .terraform/modules/renterd_cluster/modules/compute/renterd/locals.tf line 95, in locals:
│   95:     RENTERD_DB_USER         = var.database.user
│     ├────────────────
│     │ var.database is null
│ 
│ This value is null, so it does not have any attributes.
╵
╷
│ Error: Attempt to get attribute from null value
│ 
│   on .terraform/modules/renterd_cluster/modules/compute/renterd/locals.tf line 96, in locals:
│   96:     RENTERD_DB_PASSWORD     = var.database.password
│     ├────────────────
│     │ var.database is null
│ 
│ This value is null, so it does not have any attributes.
╵
╷
│ Error: Attempt to get attribute from null value
│ 
│   on .terraform/modules/renterd_cluster/modules/compute/renterd/locals.tf line 97, in locals:
│   97:     RENTERD_DB_NAME         = var.database.database
│     ├────────────────
│     │ var.database is null
│ 
│ This value is null, so it does not have any attributes.
╵
╷
│ Error: Attempt to get attribute from null value
│ 
│   on .terraform/modules/renterd_cluster/modules/compute/renterd/locals.tf line 98, in locals:
│   98:     RENTERD_DB_METRICS_NAME = var.database.metrics_database
│     ├────────────────
│     │ var.database is null
│ 
│ This value is null, so it does not have any attributes.
╵
╷
│ Error: Attempt to get attribute from null value
│ 
│   on .terraform/modules/renterd_cluster/modules/compute/renterd/locals.tf line 99, in locals:
│   99:     RENTERD_DB_SSL_MODE     = var.database.ssl_mode
│     ├────────────────
│     │ var.database is null
│ 
│ This value is null, so it does not have any attributes.
╵
Failure during /github/home/.tenv/OpenTofu/1.8.4/tofu call : exited with code 1

```

</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
